import json

# 自然语言 -> 描述性json
prompt_template_json1 = """
你是一个优化专家团队中的专业程序员。团队的目标是解决一个能源系统设备容量规划的最优化问题。您的责任是根据用户的需求，构建一个描述模型参数、优化变量、约束、目标函数的json文件。\
现在给出案例，请学习如何根据新的文本生成新的json。
```
**基础输入**：
{example_input_json1}

**基础输出**：
=====
{example_output_json1}
=====
```

由---分隔的是输入用户输入的项目信息，包括项目描述、项目地理位置、土地使用情况、项目供能对象描述、项目预期描述。
---
{input_json1}
---

请注意：
- 只生成json文件，不要生成其他文本。
现在，请深呼吸，逐步完成这个任务。

"""

solver = "gurobipy"

example_input_json1 = {
    "项目描述": "本项目为榆林科创新城零碳分布式智慧能源中心示范项目，为运动员村进行供冷、供热以及供电服务。运动员村项目包括酒店、运动 员餐厅、办公、教育、住宅、公寓、体育等建筑。项目建设用地面积93347.47 m2，总建筑面积20.6万m2，地上建筑面积14万m2，其中住宅5.6万m2，办公4.9 万m2，酒店及运动员餐厅2.1万m2，健身中心0.5万m2，配套0.9万m2。由于DK1-13#楼酒店及运动员餐厅仅大堂地暖需能源站供应，实际供能面积约为12万m2。",
    "项目地理位置":"陕西省榆林市",
    "土地使用情况":"供能面积约为12万m2",
    "项目供能对象描述": "为运动员村进行供冷、供热以及供电服务",
    "项目预期描述": "最大化系统经济型，实现零碳供应能量，设备包括但不限于光伏、燃料电池、地源热泵、电解槽、电锅炉、热泵、地热井、储氢罐、蓄水箱。"
}

example_output = {
    "问题描述": "重要！！！",
    "背景知识": "构建能源系统规划问题，在满足设备运行约束、能量平衡约束的前提下，构建经济最优目标函数，计算得到设备容量和全年运行数据",
    "约束条件": [
        "设备容量约束：各时段光伏板装机容量 p_pv_installed 不得大于其最大装机容量 p_pv_max",
        "设备容量约束：各时段太阳能集热器装机容量 g_sc_installed 不得大于其最大装机容量 g_sc_max",
        "设备容量约束：各时段氢燃料电池装机容量 p_fc_installed 不得大于其最大装机容量 p_fc_max",
        "设备容量约束：各时段电解槽装机容量 p_el_installed 不得大于其最大装机容量 p_el_max",
        "设备容量约束：各时段电锅炉装机容量 p_eb_installed 不得大于其最大装机容量 p_eb_max",
        "设备容量约束：各时段热泵装机容量 p_hp_installed 不得大于其最大装机容量 p_hp_max",
        "设备容量约束：各时段地源热泵装机容量 p_ghp_installed 不得大于其最大装机容量 p_ghp_max",
        "设备容量约束：各时段储氢罐装机容量 h_hstorage_installed 不得大于其最大装机容量 h_hstorage_max",
        "设备容量约束：各时段蓄水箱装机容量 m_tank_installed 不得大于其最大装机容量 m_tank_max",
        "设备运行约束：各时段光伏板产电量 p_pv 不得大于其转换效率 k_pv、装机容量 p_pv_installed 和当前太阳辐射强度 r_solar 的乘积",
        "设备运行约束：各时段太阳能集热器产热量 g_sc 不得大于其转换效率 k_sc、装机容量 g_sc_installed 和当前太阳辐射强度 r_solar 的乘积",
        "设备运行约束：各时段氢燃料电池产电量 p_fc 等于其电转换效率 k_fc_p 和耗氢量 h_fc 的乘积",
        "设备运行约束：各时段氢燃料电池产热量 g_fc 等于其热交换效率 eta_fc、热转换效率 k_fc_g 和耗氢量 h_fc 的乘积",
        "设备运行约束：各时段氢燃料电池发电量 p_fc 不得大于其装机容量 p_fc_installed",
        "设备运行约束：各时段电解槽产氢量 h_el 不得大于其转换效率 k_el 和电解槽耗电量 p_el 的乘积",
        "设备运行约束：各时段电解槽耗电量 p_el 不得大于其装机容量 p_el_installed",
        "设备运行约束：各时段电锅炉产热量 g_eb 等于其转换效率 k_eb 和耗电量 p_eb 的乘积",
        "设备运行约束：各时段电锅炉耗电量 p_eb 不得大于其装机容量 p_eb_installed",
        "设备运行约束：各时段热泵产热量 g_hp 等于其热转换效率 k_hp_g 和耗电量 p_hp 的乘积",
        "设备运行约束：各时段热泵产冷量 q_hp 等于其冷转换效率 k_hp_q 和耗电量 p_hp 的乘积",
        "设备运行约束：各时段热泵耗电量 p_hp 不得大于其装机容量 p_hp_installed",
        "设备运行约束：各时段地源热泵产热量 g_ghp 等于其热转换效率 k_ghp_g 和耗电量 p_ghp 的乘积",
        "设备运行约束：各时段地源热泵产冷量 q_ghp 等于其冷转换效率 k_ghp_q 和耗电量 p_ghp 的乘积",
        "设备运行约束：各时段地源热泵耗电量 p_ghp 不得大于其装机容量 p_ghp_installed",
        "设备运行约束：各时段地源热泵从所有地热井取热量 num_gtw_installed * g_gtw 不得小于",
        "设备运行约束：系统中只有氢燃料电池和电锅炉可以灌热，因此各时段地源热泵向地热井灌热量 g_ghp_inject 不得大于氢燃料电池产热量 g_fc、电锅炉产热量 g_eb 的和",
        "设备运行约束：各时段储氢罐储氢变化量 h_delta_hstorage 等于 下一时刻储氢罐储氢量 h_hstorage_next 减去当前时刻储氢罐储氢量 h_hstorage",
        "设备运行约束：i+1 时刻应满足 h_hstorage_next[i] 等于 h_hstorage[i+1]，而调度周期结束时，储氢罐储氢量 h_hstorage_next[-1] 等于初始时刻储氢罐储氢量 h_hstorage[0]",
        "设备运行约束：各时段储氢罐储氢量 h_hstorage 不得大于其装机容量 h_hstorage_installed",
        "设备运行约束：各时段蓄水箱供热量 g_tank 等于蓄水箱储能变化量 g_delta_tank 和其热损失量 g_tank_loss 之和的负值",
        "设备运行约束：各时段蓄水箱储能变化量 g_delta_tank 等于水箱中水的质量 m_tank_installed、水的比热 c_water 和水箱中水温变化量（下一时刻水箱温度 t_tank_next 减去当前时刻水箱水温 t_tank）的乘积",
        "设备运行约束：各时段蓄水箱热损失量 g_tank_loss 等于热损失系数 k_tank_loss 和水箱中水的质量 m_tank_installed、水的比热 c_water 和当前时刻水箱水温 t_tank 与环境温度 t_amb 的差值的乘积",
        "设备运行约束：i+1 时刻应满足 t_tank_next[i] 等于 t_tank[i+1]，而调度周期结束时，蓄水箱中水温 t_tank_next[-1] 等于初始时刻水温 t_tank[0]",
        "能量平衡约束：各时段系统的电力供应（包括从电网购电 p_pur、光伏产电 p_pv 和燃料电池产电 p_fc）减去向电网售电量 p_sell 应等于电力需求（包括电负载 p_load、电解槽耗电量 p_el、电锅炉耗电量 p_eb、热泵耗电量 p_hp 和地源热泵耗电量 p_ghp）",
        "能量平衡约束：各时段系统的热负荷 g_load 等于管网供热量 g_tube 和地源热泵供热 g_ghp 的和",
        "能量平衡约束：各时段管网供热量 g_tube 等于太阳能集热器产热量 g_sc、氢燃料电池产热量 g_fc、电锅炉产热量 g_eb、热泵产热量 g_hp 和蓄水箱供热量 g_tank 的和减去地源热泵向地热井灌热量 g_ghp_inject",
        "能量平衡约束：各时段储氢罐储氢变化量 h_delta_hstorage 等于从氢气市场购氢量 h_pur 和电解槽产氢量 h_el 的和减去氢燃料电池耗氢量 h_fc"
    ],
    "目标函数": "最小化所有设备年化投资费用和系统运行费用之和，其中各设备的年化投资费用由设备单价、设备容量和设备寿命计算，系统运行费用包括买电费用和买氢费用减去向电网卖电收入",
    "参数": [
        {
            "类别": "load",
            "内容": "包括建筑类型、冷负荷峰值、电负荷峰值、热负荷峰值、供热月份、供冷月份、供热面积、供电面积、供冷面积"
        },
        {
            "类别": "price",
            "内容": "分时电价、卖电价格、供热单价、供冷单价、氢气价格"
        },
        {
            "类别": "device-pv",
            "内容": "光伏装机上限、光伏装机下限、光伏板单价、光伏板寿命、光伏板效率",
            "符号": "p_max, p_min, cost, life, k_pv",
        },
        {
            "类别": "device-sc",
            "内容": "太阳能集热器装机上限、太阳能集热器装机下限、太阳能集热器单价、太阳能集热器寿命、太阳能集热器效率",
            "符号": "g_max, g_min, cost, life, k_sc",
        },
        {
            "类别": "device-fc",
            "内容": "燃料电池装机上限、燃料电池装机下限、燃料电池单价、燃料电池寿命、燃料电池效率",
            "符号": "p_max, p_min, cost, life, k_fc_p, k_fc_g",
        },
        {
            "类别": "device-el",
            "内容": "电解槽装机上限、电解槽装机下限、电解槽单价、电解槽寿命、电解槽效率",
            "符号": "p_max, p_min, cost, life, k_el",
        },
        {
            "类别": "device-eb",
            "内容": "电锅炉装机上限、电锅炉装机下限、电锅炉单价、电锅炉寿命、电锅炉效率",
            "符号": "p_max, p_min, cost, life, k_eb",
        },
        {
            "类别": "device-hp",
            "内容": "热泵装机上限、热泵装机下限、热泵单价、热泵寿命、热泵效率",
            "符号": "p_max, p_min, cost, life, k_hp_g, k_hp_q",
        },
        {
            "类别": "device-ghp",
            "内容": "地源热泵装机上限、地源热泵装机下限、地源热泵单价、地源热泵寿命、地源热泵效率",
            "符号": "p_max, p_min, cost, life, k_ghp_g, k_ghp_q",
        },
        {
            "类别": "device-gtw",
            "内容": "地热井最大数量、地热井单价、地热井寿命、单个地热井的功率",
            "符号": "number_max, cost, life, g_gtw",
        },
        {
            "类别": "device-hst",
            "内容": "储氢罐最大容量、储氢罐最小容量、储氢罐单价、储氢罐寿命",
            "符号": "h_max, h_min, cost, life",
        },
        {
            "类别": "device-ht",
            "内容": "热水箱最大容量、热水箱最小容量、热水箱单价、热水箱寿命、热水箱最高温度、热水箱最低温度、热水箱损失系数",
            "符号": "m_max, h=m_min, cost, life, g_ht",
        },
        {
            "类别": "carbon",
            "内容": "氢气、电、天然气的碳排放因子"
        },
    ],
    "变量": [
        {
            "符号": "h_pur",
            "定义": "从氢气市场购氢量",
            "形状": ["period"]
        },
        {
            "符号": "p_pur",
            "定义": "从电网购电量",
            "形状": ["period"]
        },
        {
            "符号": "p_sell",
            "定义": "向电网卖电量",
            "形状": ["period"]
        },
        {
            "符号": "p_pv_installed",
            "定义": "光伏板装机容量",
            "形状": []
        },
        {
            "符号": "g_sc_installed",
            "定义": "太阳能集热器装机容量",
            "形状": []
        },
        {
            "符号": "p_fc_installed",
            "定义": "氢燃料电池装机容量",
            "形状": []
        },
        {
            "符号": "p_el_installed",
            "定义": "电解槽装机容量",
            "形状": []
        },
        {
            "符号": "p_eb_installed",
            "定义": "电锅炉装机容量",
            "形状": []
        },
        {
            "符号": "p_hp_installed",
            "定义": "热泵装机容量",
            "形状": []
        },
        {
            "符号": "p_ghp_installed",
            "定义": "地源热泵装机容量",
            "形状": []
        },
        {
            "符号": "num_gtw_installed",
            "定义": "地热井装机数量",
            "形状": []
        },
        {
            "符号": "h_hstorage_installed",
            "定义": "储氢罐装机容量",
            "形状": []
        },
        {
            "符号": "m_tank_installed",
            "定义": "蓄水箱装机容量",
            "形状": []
        },
        {
            "符号": "p_pv",
            "定义": "光伏板产电量",
            "形状": ["period"]
        },
        {
            "符号": "g_sc",
            "定义": "太阳能集热器产热量",
            "形状": ["period"]
        },
        {
            "符号": "p_fc",
            "定义": "氢燃料电池产电量",
            "形状": ["period"]
        },
        {
            "符号": "g_fc",
            "定义": "氢燃料电池产热量",
            "形状": ["period"]
        },
        {
            "符号": "h_fc",
            "定义": "氢燃料电池耗氢量",
            "形状": ["period"]
        },
        {
            "符号": "h_el",
            "定义": "电解槽产氢量",
            "形状": ["period"]
        },
        {
            "符号": "p_el",
            "定义": "电解槽耗电量",
            "形状": ["period"]
        },
        {
            "符号": "g_eb",
            "定义": "电锅炉产热量",
            "形状": ["period"]
        },
        {
            "符号": "p_eb",
            "定义": "电锅炉耗电量",
            "形状": ["period"]
        },
        {
            "符号": "g_hp",
            "定义": "热泵产热量",
            "形状": ["period"]
        },
        {
            "符号": "q_hp",
            "定义": "热泵产冷量",
            "形状": ["period"]
        },
        {
            "符号": "p_hp",
            "定义": "热泵耗电量",
            "形状": ["period"]
        },
        {
            "符号": "g_ghp",
            "定义": "地源热泵产热量",
            "形状": ["period"]
        },
        {
            "符号": "q_ghp",
            "定义": "地源热泵产冷量",
            "形状": ["period"]
        },
        {
            "符号": "p_ghp",
            "定义": "地源热泵耗电量",
            "形状": ["period"]
        },
        {
            "符号": "g_ghp_inject",
            "定义": "地源热泵向地热井灌热量",
            "形状": ["period"]
        },
        {
            "符号": "h_delta_hstorage",
            "定义": "储氢罐储氢变化量",
            "形状": ["period"]
        },
        {
            "符号": "h_hstorage",
            "定义": "储氢罐储氢量",
            "形状": ["period"]
        },
        {
            "符号": "h_hstorage_next",
            "定义": "储氢罐下一时刻储氢量",
            "形状": ["period"]
        },
        {
            "符号": "g_tank",
            "定义": "蓄水箱供热量",
            "形状": ["period"]
        },
        {
            "符号": "g_delta_tank",
            "定义": "蓄水箱储能变化量",
            "形状": ["period"]
        },
        {
            "符号": "g_tank_loss",
            "定义": "蓄水箱热损失量",
            "形状": ["period"]
        },
        {
            "符号": "t_tank",
            "定义": "蓄水箱水温",
            "形状": ["period"]
        },
        {
            "符号": "t_tank_next",
            "定义": "蓄水箱下一时刻水温",
            "形状": ["period"]
        }
    ]
}


device_input = {
    "项目描述": "本项目为榆林科创新城零碳分布式智慧能源中心示范项目，为运动员村进行供冷、供热以及供电服务。运动员村项目包括酒店、运动 员餐厅、办公、教育、住宅、公寓、体育等建筑。项目建设用地面积93347.47 m2，总建筑面积20.6万m2，地上建筑面积14万m2，其中住宅5.6万m2，办公4.9 万m2，酒店及运动员餐厅2.1万m2，健身中心0.5万m2，配套0.9万m2。由于DK1-13#楼酒店及运动员餐厅仅大堂地暖需能源站供应，实际供能面积约为12万m2。",
    "项目地理位置":"陕西省榆林市",
    "土地使用情况":"供能面积约为12万m2",
    "项目供能对象描述": "为运动员村进行供冷、供热以及供电服务",
    "项目预期描述": "最大化系统经济型，实现零碳供应能量，设备包括但不限于光伏、燃料电池、地源热泵、电解槽、电锅炉、热泵、地热井、储氢罐、蓄水箱。但是燃料电池容量不低于500kW。光伏板装机不超过2000kW,燃料电池的装机容量等于电解槽的装机容量。"
}
prompt = prompt_template_json1.format(
    solver=solver,
    example_input_json1=json.dumps(example_input_json1, indent=4, ensure_ascii=False),
    example_output_json1=example_output,
    input_json1=json.dumps(device_input, ensure_ascii=False),
)

print(prompt)
